{
  "terms": [
    {
      "slug": "data-enrichment",
      "term": "Data Enrichment",
      "short_definition": "The process of appending additional data points to existing records in your CRM or database.",
      "full_definition": "Data enrichment takes your existing contacts, leads, or accounts and fills in missing information. That might mean appending firmographic data (company size, revenue, industry), demographic data (job title, email, phone), technographic data (what software they use), or intent signals (what topics they're researching).",
      "why_it_matters": "Without enrichment, your CRM is full of half-complete records. Sales reps waste time researching prospects manually, marketing can't segment effectively, and lead scoring models don't have enough signals to work with. Enrichment automates what used to be hours of manual research.",
      "example": "You import 500 leads from a webinar. Each record has a name and email. An enrichment tool like ZoomInfo or Clearbit appends company name, size, industry, title, phone number, and technology stack to each record automatically.",
      "related_terms": [
        "firmographic-data",
        "technographic-data",
        "intent-data"
      ],
      "related_tools": [
        "zoominfo",
        "clearbit",
        "apollo",
        "clay"
      ],
      "category_slug": "enrichment",
      "related_roundups": [
        "best-data-enrichment-tools",
        "best-data-enrichment-tools-for-smb"
      ]
    },
    {
      "slug": "intent-data",
      "term": "Intent Data",
      "short_definition": "Behavioral signals that indicate a company or person is actively researching a specific topic or solution.",
      "full_definition": "Intent data captures online research behavior across the web, including content consumption, search queries, product review visits, and competitor page views. There are two types: first-party intent (tracked on your own website via tools like 6sense or Warmly) and third-party intent (aggregated from publisher networks, review sites, and content platforms like Bombora or TechTarget).",
      "why_it_matters": "Intent data lets sales and marketing teams prioritize accounts that are actively in-market for their solution. Instead of spraying outreach to cold lists, you can focus on companies that are already researching your category. This improves conversion rates and reduces wasted effort.",
      "example": "6sense detects that Acme Corp has had 12 employees researching 'data enrichment tools' and 'ZoomInfo alternatives' in the past two weeks. Your sales team gets an alert to prioritize Acme in their outreach cadence.",
      "related_terms": [
        "abm",
        "data-enrichment",
        "lead-scoring"
      ],
      "related_tools": [
        "6sense",
        "bombora",
        "warmly"
      ],
      "category_slug": "intent",
      "related_roundups": [
        "best-b2b-intent-data-tools"
      ]
    },
    {
      "slug": "abm",
      "term": "Account-Based Marketing (ABM)",
      "short_definition": "A B2B marketing strategy that focuses on targeted accounts rather than broad-based lead generation.",
      "full_definition": "ABM flips the traditional marketing funnel. Instead of casting a wide net and qualifying leads down to accounts, ABM starts with a defined list of target accounts and directs personalized marketing and sales efforts at those specific companies. It requires tight alignment between sales and marketing teams, shared account lists, and coordinated multi-channel outreach.",
      "why_it_matters": "For companies selling high-value deals to enterprise buyers, ABM is more efficient than inbound lead gen. It concentrates budget on accounts that match your ideal customer profile, which typically produces higher win rates and larger deal sizes. Research consistently shows ABM programs outperform traditional demand gen for enterprise sales motions.",
      "example": "Your marketing team identifies 200 target accounts based on firmographic fit and intent signals. They run LinkedIn ads, direct mail, and personalized email campaigns specifically to contacts at those 200 companies, while sales runs outbound cadences to the same list.",
      "related_terms": [
        "intent-data",
        "lead-scoring",
        "firmographic-data"
      ],
      "related_tools": [
        "6sense"
      ],
      "category_slug": "abm",
      "related_roundups": [
        "best-abm-platforms",
        "best-abm-tools-for-mid-market"
      ]
    },
    {
      "slug": "firmographic-data",
      "term": "Firmographic Data",
      "short_definition": "Descriptive attributes about a company, such as industry, revenue, employee count, and location.",
      "full_definition": "Firmographics are to companies what demographics are to individuals. They describe the characteristics of a business: industry, annual revenue, number of employees, headquarters location, funding stage, and organizational structure. This data is foundational for lead scoring, market segmentation, and ideal customer profile (ICP) definition.",
      "why_it_matters": "Firmographic data is the first filter in any B2B targeting strategy. You can't sell enterprise software to a 5-person startup (or shouldn't be trying to). Firmographics help sales and marketing teams qualify accounts before any outreach begins.",
      "example": "Your ICP is SaaS companies with 200-2,000 employees and $20M+ ARR. Firmographic data from ZoomInfo or Apollo lets you filter your prospecting list to only companies matching those criteria.",
      "related_terms": [
        "data-enrichment",
        "technographic-data",
        "lead-scoring"
      ],
      "related_tools": [
        "zoominfo",
        "apollo",
        "clearbit"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "technographic-data",
      "term": "Technographic Data",
      "short_definition": "Information about what technology products and platforms a company uses.",
      "full_definition": "Technographic data reveals a company's technology stack: what CRM they run, which marketing automation platform they use, their cloud provider, analytics tools, and more. This data is collected through web scraping (detecting JavaScript tags, DNS records, job postings), surveys, and partnership data from technology platforms.",
      "why_it_matters": "Knowing a prospect's tech stack tells you whether your product integrates with their existing tools, whether they're using a competitor, and what their technical maturity level is. A company running Salesforce Enterprise is a different buyer than one using a spreadsheet for CRM.",
      "example": "You sell a Salesforce integration. Technographic data reveals that 800 companies in your target market run Salesforce Enterprise. That's your addressable market. The 200 running HubSpot might be a secondary target if you build that integration.",
      "related_terms": [
        "firmographic-data",
        "data-enrichment",
        "intent-data"
      ],
      "related_tools": [
        "zoominfo",
        "clearbit"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "lead-scoring",
      "term": "Lead Scoring",
      "short_definition": "A methodology for ranking leads based on their likelihood to convert to a customer.",
      "full_definition": "Lead scoring assigns numerical values to leads based on two dimensions: fit (how closely they match your ideal customer profile) and engagement (how actively they're interacting with your brand). Fit scoring uses firmographic and demographic data. Engagement scoring uses behavioral data like email opens, website visits, content downloads, and product usage. Most CRMs and marketing automation platforms include lead scoring functionality.",
      "why_it_matters": "Without lead scoring, sales teams treat all leads equally. A VP at an enterprise company who visited your pricing page three times gets the same priority as a student who downloaded a whitepaper. Lead scoring eliminates this guesswork by quantifying which leads deserve immediate attention.",
      "example": "A lead scores 85/100 because they're a Director at a 500-person SaaS company (high fit), visited your pricing page twice, attended a webinar, and opened 4 emails (high engagement). They get routed to a senior AE immediately.",
      "related_terms": [
        "intent-data",
        "firmographic-data",
        "data-enrichment"
      ],
      "related_tools": [
        "hubspot",
        "salesforce",
        "6sense"
      ],
      "category_slug": "crm",
      "related_roundups": [
        "best-lead-scoring-tools"
      ]
    },
    {
      "slug": "data-hygiene",
      "term": "Data Hygiene",
      "short_definition": "The ongoing practice of maintaining clean, accurate, and up-to-date data in your CRM and databases.",
      "full_definition": "Data hygiene encompasses deduplication (merging duplicate records), standardization (normalizing formats for phone numbers, addresses, titles), validation (verifying emails and phone numbers are still active), decay management (identifying and updating stale records), and enrichment (filling in missing fields). It's not a one-time project. B2B data decays at roughly 30% per year as people change jobs, companies merge, and contact details change.",
      "why_it_matters": "Dirty data cascades through every downstream process. Bad emails increase bounce rates (hurting deliverability). Duplicate records create confusing customer experiences. Stale data wastes sales time on prospects who've already left the company. The cost of bad data compounds over time.",
      "example": "A quarterly data hygiene audit reveals 15% duplicate accounts, 22% of email addresses bouncing, and 8% of contacts listing a company they no longer work for. A cleanup project using DemandTools and a verification service fixes these issues.",
      "related_terms": [
        "data-enrichment",
        "data-validation"
      ],
      "related_tools": [
        "demandtools",
        "verum"
      ],
      "category_slug": "cleaning",
      "related_roundups": [
        "best-data-quality-tools"
      ]
    },
    {
      "slug": "data-validation",
      "term": "Data Validation",
      "short_definition": "The process of verifying that data is accurate, complete, and in the correct format.",
      "full_definition": "Data validation checks whether data meets quality standards before it enters or stays in your system. Email validation confirms addresses are deliverable (syntax check, domain check, mailbox verification). Phone validation verifies numbers are active and reachable. Address validation standardizes and verifies physical addresses against postal databases. Field-level validation ensures data conforms to expected formats (e.g., phone numbers have the right number of digits).",
      "why_it_matters": "Sending emails to invalid addresses damages your sender reputation. Calling dead phone numbers wastes rep time. Bad addresses cause returned mail and failed deliveries. Validation at the point of entry prevents garbage data from getting into your system in the first place.",
      "example": "You integrate an email validation API into your web forms. When a visitor types 'john@gmial.com', the system catches the typo in real-time and suggests 'john@gmail.com' before the lead enters your CRM.",
      "related_terms": [
        "data-hygiene",
        "data-enrichment"
      ],
      "related_tools": [
        "demandtools",
        "verum"
      ],
      "category_slug": "validation"
    },
    {
      "slug": "revops",
      "term": "Revenue Operations (RevOps)",
      "short_definition": "A business function that aligns sales, marketing, and customer success operations to drive predictable revenue growth.",
      "full_definition": "RevOps breaks down the traditional silos between sales ops, marketing ops, and customer success ops. A RevOps team owns the end-to-end revenue process: lead management, pipeline operations, forecasting, tool administration, data governance, and reporting. The function emerged because companies realized that siloed ops teams create disconnected tech stacks, inconsistent data, and conflicting processes.",
      "why_it_matters": "RevOps is the fastest-growing ops function in B2B. Companies with dedicated RevOps teams report better pipeline visibility, more accurate forecasting, and higher conversion rates. The role has moved from a nice-to-have to a core function at most B2B companies with 50+ employees.",
      "example": "A RevOps team at a 200-person SaaS company manages the Salesforce CRM, HubSpot Marketing Hub, ZoomInfo enrichment pipeline, Gong conversation intelligence, and Salesloft cadences. They ensure data flows cleanly between all systems and report on full-funnel metrics.",
      "related_terms": [
        "lead-scoring",
        "data-hygiene",
        "abm"
      ],
      "related_tools": [
        "salesforce",
        "hubspot"
      ],
      "category_slug": "crm",
      "related_roundups": [
        "best-revops-tools"
      ]
    },
    {
      "slug": "sales-engagement",
      "term": "Sales Engagement",
      "short_definition": "Software platforms that help sales teams execute multi-channel outreach cadences at scale.",
      "full_definition": "Sales engagement platforms orchestrate outbound sales activity across email, phone, social, and direct mail channels. They provide cadence management (structured sequences of touches), email automation with personalization, power dialers, analytics, and CRM sync. The category sits between your CRM (system of record) and your communication tools (email, phone), automating the execution layer of outbound sales.",
      "why_it_matters": "Manual outbound doesn't scale. A sales rep can manage maybe 20-30 prospects by hand. A sales engagement platform lets them run structured cadences to 200+ prospects simultaneously while tracking every interaction. The data from these platforms also feeds coaching and process optimization.",
      "example": "An SDR creates a 14-day cadence in Salesloft with 5 emails, 3 phone calls, and 2 LinkedIn touchpoints. They enroll 50 new prospects daily. The platform automates email sends, queues calls, and tracks open/reply rates across the sequence.",
      "related_terms": [
        "revops",
        "lead-scoring"
      ],
      "related_tools": [
        "salesloft",
        "apollo",
        "instantly"
      ],
      "category_slug": "list-building",
      "related_roundups": [
        "best-sales-engagement-platforms"
      ]
    },
    {
      "slug": "customer-data-platform",
      "term": "Customer Data Platform (CDP)",
      "short_definition": "A platform that unifies customer data from multiple sources into a single, persistent profile.",
      "full_definition": "A customer data platform collects first-party data from your website, CRM, email tools, support tickets, and other touchpoints, then stitches it together into one record per person. Unlike a data warehouse, a CDP is built for activation. It's designed so marketing and sales teams can segment audiences and trigger campaigns without writing SQL or waiting on an analyst.",
      "why_it_matters": "Without a CDP, customer data lives in silos. Marketing sees email engagement, sales sees CRM activity, and support sees tickets, but nobody has the full picture. That fragmentation leads to duplicate outreach, conflicting messages, and missed upsell signals. A CDP gives every team the same unified view so they can act on it.",
      "example": "A B2B SaaS company connects HubSpot, Intercom, Stripe, and their product database to Hightouch. When a free-tier user hits a usage threshold and also opens a pricing email, the CDP creates a unified signal that triggers a sales alert and moves the account into a targeted ad audience.",
      "related_terms": [
        "data-enrichment",
        "data-validation"
      ],
      "related_tools": [
        "hightouch",
        "census-data",
        "salesforce",
        "hubspot"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "reverse-etl",
      "term": "Reverse ETL",
      "short_definition": "The process of syncing data from a data warehouse back into operational business tools like CRMs and marketing platforms.",
      "full_definition": "Reverse ETL flips the traditional data pipeline. Instead of pulling data from business tools into a warehouse for analysis, it pushes modeled data back out to the tools where teams actually work. Think of it as the last mile of the modern data stack. Your analytics team builds models in dbt or Looker, and reverse ETL makes those models actionable in Salesforce, HubSpot, Marketo, or wherever your go-to-market team operates.",
      "why_it_matters": "Most companies have better data in their warehouse than in their CRM. Lead scores, health scores, product usage metrics, and segmentation models sit in BigQuery or Snowflake where sales reps can't see them. Reverse ETL closes that gap. It means the data team's work actually reaches the people making decisions, without building custom integrations for every tool.",
      "example": "Your data team builds a product-qualified lead score in Snowflake using signup data, feature usage, and billing info. Census syncs that score to a custom field in Salesforce every hour. Reps can now sort their pipeline by PQL score and prioritize accounts showing real buying signals instead of guessing.",
      "related_terms": [
        "data-enrichment",
        "data-hygiene"
      ],
      "related_tools": [
        "hightouch",
        "census-data",
        "fivetran",
        "airbyte"
      ],
      "category_slug": "orchestration"
    },
    {
      "slug": "sales-intelligence",
      "term": "Sales Intelligence",
      "short_definition": "Technology and data that helps sales teams identify, target, and engage the right buyers at the right time.",
      "full_definition": "Sales intelligence platforms combine contact databases, firmographic data, technographic signals, and buying intent into a single workflow. They're designed to answer three questions: who should I sell to, what do I know about them, and when is the right time to reach out? The best platforms layer multiple data types so reps aren't just cold-calling from a list. They're reaching out with context.",
      "why_it_matters": "Reps spend roughly 40% of their time researching prospects and finding contact info. That's time they aren't selling. Sales intelligence tools compress hours of manual research into seconds. More importantly, they surface signals that reps would never find on their own, like technology changes, hiring surges, or funding rounds that indicate buying windows.",
      "example": "An AE targeting mid-market fintech companies uses ZoomInfo to build a list of CFOs at companies with 200-500 employees that recently raised Series B funding. Apollo flags three of those accounts as showing intent around 'payment processing solutions.' The AE writes personalized outreach referencing the funding round and the specific pain point.",
      "related_terms": [
        "intent-data",
        "data-enrichment",
        "lead-scoring"
      ],
      "related_tools": [
        "zoominfo",
        "apollo",
        "cognism",
        "linkedin-sales-navigator",
        "clearbit"
      ],
      "category_slug": "enrichment",
      "related_roundups": [
        "best-sales-intelligence-tools"
      ]
    },
    {
      "slug": "buyer-intent",
      "term": "Buyer Intent",
      "short_definition": "Signals that indicate a prospect is actively researching or considering a purchase in your category.",
      "full_definition": "Buyer intent captures the digital footprint of someone moving through a buying process. That includes searching for relevant keywords, visiting review sites like G2 or TrustRadius, reading competitor content, attending webinars, or downloading whitepapers. Intent platforms aggregate these signals across thousands of publisher sites and score accounts based on research intensity. First-party intent tracks behavior on your own site. Third-party intent tracks behavior across the broader web.",
      "why_it_matters": "Timing is everything in B2B sales. Reaching an account six months before they're ready to buy wastes effort. Reaching them two weeks after they've signed with a competitor wastes even more. Buyer intent data tells you which accounts are in-market right now, so you can prioritize outreach to companies that are already thinking about solutions like yours.",
      "example": "Bombora detects that a target account has had multiple employees researching 'CRM migration,' 'Salesforce alternatives,' and 'HubSpot enterprise pricing' over the past three weeks. The intent score spikes from 40 to 85. Your SDR team gets an alert and moves that account to the top of their outreach queue with messaging focused on CRM switching costs.",
      "related_terms": [
        "intent-data",
        "abm",
        "lead-scoring"
      ],
      "related_tools": [
        "6sense",
        "demandbase",
        "bombora",
        "zoominfo"
      ],
      "category_slug": "intent"
    },
    {
      "slug": "data-orchestration",
      "term": "Data Orchestration",
      "short_definition": "The automated coordination of data flows between multiple systems, tools, and processes.",
      "full_definition": "Data orchestration is the connective tissue of a modern go-to-market stack. It handles the logic of when data moves, where it goes, and what happens along the way. That might mean enriching a new lead in HubSpot, routing it to the right sales rep, syncing the record to Outreach, and updating a reporting dashboard, all triggered automatically by a single form submission. It goes beyond point-to-point integrations by managing multi-step workflows with branching logic, error handling, and conditional transforms.",
      "why_it_matters": "Most teams run 15-30 SaaS tools. Without orchestration, data gets stuck in silos or requires manual copy-paste between systems. That creates delays, errors, and inconsistencies. When your orchestration breaks, your whole revenue engine slows down. Good orchestration means every team works with the same data, at the same time, without anyone manually moving spreadsheets around.",
      "example": "A new inbound lead fills out a demo form. Zapier triggers a workflow: the lead is enriched via Clearbit, scored by a custom model, routed to the right SDR in Salesforce based on territory rules, added to a personalized Outreach sequence, and flagged in Slack for the sales manager. All of this happens in under 60 seconds with no manual steps.",
      "related_terms": [
        "data-enrichment",
        "data-hygiene",
        "revops"
      ],
      "related_tools": [
        "workato-ipaas",
        "zapier",
        "make",
        "n8n",
        "boomi",
        "mulesoft"
      ],
      "category_slug": "orchestration",
      "related_roundups": [
        "best-data-integration-tools"
      ]
    },
    {
      "slug": "sales-automation",
      "term": "Sales Automation",
      "short_definition": "Technology that automates repetitive sales tasks like follow-up emails, data entry, lead routing, and activity logging.",
      "full_definition": "Sales automation handles the mechanical work that eats into a rep's selling time. That includes automated email sequences (drip campaigns that fire based on time or prospect behavior), CRM data entry (logging calls, updating deal stages, capturing meeting notes), lead routing (assigning new leads to the right rep based on territory, round-robin, or scoring rules), and task creation (automatically generating follow-up reminders after meetings or when deals go cold).",
      "why_it_matters": "Sales reps spend roughly 30% of their time actually selling. The rest goes to data entry, administrative tasks, internal meetings, and prospecting logistics. Sales automation reclaims a chunk of that non-selling time by eliminating manual steps. A rep who doesn't have to remember to follow up, log activities, or update deal stages can focus on conversations that close deals.",
      "example": "An SDR connects with a prospect on a call. When the call ends, Gong transcribes it and pushes a summary to Salesforce. Outreach automatically creates a follow-up task for 3 days later. If the prospect doesn't respond, an automated email sequence starts 5 days after the call with personalized content. The SDR didn't touch the CRM once.",
      "related_terms": [
        "sales-engagement",
        "sales-cadence",
        "revops"
      ],
      "related_tools": [
        "salesloft",
        "outreach-io",
        "hubspot",
        "salesforce"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "buyer-journey",
      "term": "Buyer Journey",
      "short_definition": "The process a B2B buyer goes through from initial awareness of a problem to selecting and purchasing a solution.",
      "full_definition": "The buyer journey maps the stages a prospect moves through before becoming a customer. In B2B, it typically follows three phases: awareness (the buyer recognizes a problem or opportunity), consideration (the buyer evaluates different approaches and solutions), and decision (the buyer selects a vendor and negotiates terms). B2B buyer journeys are longer and more complex than B2C, often involving 6-10 stakeholders, 3-6 month sales cycles, and dozens of content touchpoints before a purchase decision.",
      "why_it_matters": "Aligning your marketing and sales efforts to the buyer's actual journey is what separates targeted outreach from spam. A prospect in the awareness stage doesn't want a demo. A prospect in the decision stage doesn't want a blog post about industry trends. Understanding where accounts sit in their journey lets you deliver the right content, through the right channel, at the right time. Intent data has made this mapping more precise by revealing which stage a company is in based on their research behavior.",
      "example": "A VP of Sales at a mid-market company reads three blog posts about CRM migration (awareness). She downloads a CRM comparison guide and visits G2 to read reviews (consideration). She requests demos from two vendors and involves her CFO and IT director in evaluation calls (decision). Each stage requires different content and engagement from the selling organization.",
      "related_terms": [
        "buyer-intent",
        "intent-data",
        "lead-scoring",
        "abm"
      ],
      "related_tools": [
        "6sense",
        "demandbase",
        "hubspot"
      ],
      "category_slug": "intent"
    },
    {
      "slug": "lead-routing",
      "term": "Lead Routing",
      "short_definition": "The automated process of assigning incoming leads to the right sales rep based on predefined rules.",
      "full_definition": "Lead routing determines which sales rep gets which lead. The simplest approach is round-robin (each rep gets the next lead in rotation). More sophisticated routing uses rules based on territory (geographic or industry assignment), deal size (enterprise leads go to senior reps), product interest (route to the specialist), account ownership (existing customer leads go to their assigned rep), or lead score (hot leads get routed to top performers). Speed-to-lead studies consistently show that responding to an inbound lead within 5 minutes vs. 30 minutes increases conversion rates by 10x or more.",
      "why_it_matters": "Slow or incorrect routing kills conversions. A lead that sits unassigned for 24 hours has already moved on. A lead routed to the wrong rep (wrong territory, wrong product line) creates a bad first impression and internal friction. Automated routing eliminates the 'someone will get to it' gap and ensures every lead hits the right rep's queue within seconds of arriving.",
      "example": "A director of marketing at a 500-person company in Chicago fills out a demo request form. The CRM checks: company size (mid-market routing), industry (technology), geography (Central territory), existing account owner (none). The lead is automatically assigned to the Central mid-market AE, a Slack notification fires, and the rep's Outreach sequence starts a personalized cadence within 2 minutes of form submission.",
      "related_terms": [
        "lead-scoring",
        "revops",
        "sales-automation"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "salesloft"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "data-deduplication",
      "term": "Data Deduplication",
      "short_definition": "The process of identifying and merging or removing duplicate records in a database or CRM.",
      "full_definition": "Data deduplication (dedup) finds and resolves duplicate records that accumulate in CRMs and databases. Duplicates happen when the same person or company gets entered multiple times through different channels (web forms, manual entry, data imports, integrations). Basic deduplication matches on exact fields (same email address). Advanced deduplication uses fuzzy matching (\"John Smith\" at \"Acme Corp\" vs. \"J. Smith\" at \"Acme Corporation\"), domain matching, and probabilistic algorithms to catch near-duplicates that exact matching misses.",
      "why_it_matters": "Duplicates wreck everything downstream. Lead routing breaks when the same company has three records assigned to different reps. Marketing sends the same person three emails. Pipeline reporting inflates because the same opportunity appears twice. Territory planning miscounts accounts. Sales reps waste time calling the same prospect that a colleague already spoke to. Studies estimate that 10-30% of CRM records are duplicates in the average B2B organization.",
      "example": "Your CRM has three records for the same person: 'Michael Johnson' from a trade show scan, 'Mike Johnson' from a web form, and 'M. Johnson' imported via your data enrichment tool. All three have different email formats but the same company domain. A deduplication tool identifies all three as the same person, merges the records (keeping the most complete data from each), and assigns one clean master record to the correct account owner.",
      "related_terms": [
        "data-hygiene",
        "data-validation",
        "data-enrichment"
      ],
      "related_tools": [
        "demandtools",
        "salesforce",
        "hubspot"
      ],
      "category_slug": "data-quality"
    },
    {
      "slug": "sales-cadence",
      "term": "Sales Cadence",
      "short_definition": "A structured sequence of outreach touchpoints (emails, calls, social touches) designed to engage a prospect over a defined period.",
      "full_definition": "A sales cadence is a playbook for prospect engagement. It defines what to do, when, and through which channel. A typical outbound cadence might span 14-21 days with 8-12 touchpoints: Day 1 email, Day 2 LinkedIn connection, Day 3 call, Day 5 email, Day 7 call, Day 10 email with case study, Day 14 breakup email. Cadences can be manual (rep executes each step), semi-automated (emails fire automatically, calls and social are manual), or fully automated (all steps execute without rep input). Sales engagement platforms like Outreach and Salesloft are built around cadence management.",
      "why_it_matters": "Without a defined cadence, reps follow up inconsistently. Some prospects get five touches in two days (annoying). Others get one email and then nothing for a month (forgotten). Structured cadences ensure every prospect gets the right number of touches at the right intervals, which directly impacts reply rates and pipeline generation. Data from multiple studies shows that multi-channel cadences (email + phone + social) outperform single-channel approaches by 2-3x on reply rates.",
      "example": "An SDR adds a target prospect to a 14-day multi-channel cadence in Outreach. Day 1: personalized email referencing the company's recent funding round. Day 2: LinkedIn connection request with a short note. Day 4: phone call attempt. Day 7: follow-up email with a relevant case study. Day 10: call + voicemail. Day 14: final breakup email. If the prospect replies at any point, the cadence pauses and the rep takes over manually.",
      "related_terms": [
        "sales-engagement",
        "sales-automation"
      ],
      "related_tools": [
        "outreach-io",
        "salesloft",
        "apollo",
        "instantly",
        "lemlist"
      ],
      "category_slug": "crm",
      "related_roundups": [
        "best-cold-email-tools",
        "best-sales-engagement-platforms"
      ]
    },
    {
      "slug": "gtm-strategy",
      "term": "Go-to-Market (GTM) Strategy",
      "short_definition": "The plan a company uses to bring a product to market, including target audience, messaging, pricing, and distribution channels.",
      "full_definition": "A go-to-market strategy defines how a company will reach its target customers and achieve competitive advantage. It covers four core elements: target market definition (who you're selling to), value proposition (why they should buy), distribution channels (how you reach them), and pricing model (how you charge). In B2B, GTM strategies typically fall into two camps: sales-led (outbound reps drive deals) and product-led (the product itself drives adoption and expansion).",
      "why_it_matters": "A GTM strategy determines which tools you need in your stack. Sales-led GTM demands CRM, sales engagement, and prospecting tools. Product-led GTM requires analytics, product usage tracking, and self-serve onboarding. Intent data and ABM platforms serve companies running account-based GTM. Your GTM motion shapes your entire technology stack.",
      "example": "A B2B SaaS company launches a new product. Their GTM strategy: target VP-level buyers at mid-market companies (200-2,000 employees) in financial services. Sales-led motion with SDR outbound using Apollo for prospecting, Salesloft for sequences, and 6sense for intent data to prioritize accounts. Marketing supports with content and LinkedIn ads via RollWorks.",
      "related_terms": [
        "abm",
        "sales-engagement",
        "buyer-journey"
      ],
      "related_tools": [
        "apollo",
        "hubspot",
        "6sense",
        "salesloft"
      ],
      "category_slug": "list-building"
    },
    {
      "slug": "product-led-growth",
      "term": "Product-Led Growth (PLG)",
      "short_definition": "A business strategy where the product itself drives user acquisition, activation, and expansion rather than traditional sales teams.",
      "full_definition": "Product-led growth uses the product as the primary vehicle for customer acquisition and revenue expansion. Users sign up for a free or low-cost version, experience value, and upgrade to paid plans or enterprise tiers. The product handles onboarding, feature discovery, and upselling that would traditionally require salespeople. Companies like Slack, Zoom, and Figma popularized this model. The data stack for PLG companies looks different from sales-led organizations: product analytics (Amplitude, Mixpanel) matter more than sales engagement tools, and CRM enrichment focuses on identifying which free users represent enterprise opportunities.",
      "why_it_matters": "PLG companies use different tools than sales-led companies. Instead of outbound prospecting tools, PLG companies invest in product analytics, user behavior tracking, and enrichment tools that identify which free users work at target accounts. Clearbit (now HubSpot) and 6sense are popular for this: identifying anonymous website visitors and enriching sign-up data to surface enterprise leads from the self-serve funnel.",
      "example": "A PLG company offers a free tier. 10,000 users sign up monthly. Clearbit enriches each sign-up with company data (size, industry, funding). The RevOps team uses enrichment data to flag when 5+ users from the same company sign up, triggering a sales-assisted motion for enterprise conversion.",
      "related_terms": [
        "gtm-strategy",
        "buyer-journey",
        "lead-scoring"
      ],
      "related_tools": [
        "hubspot",
        "clearbit",
        "apollo"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "sales-enablement",
      "term": "Sales Enablement",
      "short_definition": "The process of providing sales teams with the content, tools, training, and data they need to close deals effectively.",
      "full_definition": "Sales enablement bridges the gap between marketing content and sales execution. It covers four areas: content management (battlecards, case studies, decks), training and coaching (onboarding, call coaching, certifications), tools and technology (CRM, engagement platforms, content management systems), and data and analytics (win/loss analysis, content usage tracking, rep performance). The function has grown from a marketing sub-team into a standalone department at many B2B companies.",
      "why_it_matters": "Sales enablement determines which tools get adopted and how effectively reps use them. A well-equipped enablement function ensures reps can find the right content, use their tools correctly, and act on data insights. Without enablement, companies buy expensive tools (CRM, engagement platforms, intent data) that reps barely use. It's the difference between having tools and having productive tools.",
      "example": "A sales enablement team implements Gong for call coaching, creates battlecards comparing their product to competitors (using data from DataStackGuide), builds a training program for new reps on Salesforce and Salesloft, and tracks which content reps share most during deal cycles.",
      "related_terms": [
        "sales-engagement",
        "sales-intelligence",
        "revops"
      ],
      "related_tools": [
        "gong-engage",
        "salesloft",
        "salesforce",
        "hubspot"
      ],
      "category_slug": "list-building"
    },
    {
      "slug": "data-warehouse",
      "term": "Data Warehouse",
      "short_definition": "A centralized repository that stores structured data from multiple sources for analysis and reporting.",
      "full_definition": "A data warehouse collects data from operational systems (CRM, marketing automation, billing, product analytics) and stores it in a structured format optimized for analysis. Modern cloud data warehouses (Snowflake, BigQuery, Redshift, Databricks) have replaced on-premise solutions for most companies. The warehouse acts as the single source of truth for business intelligence, feeding dashboards, reports, and reverse ETL tools that push insights back into operational tools.",
      "why_it_matters": "Data warehouses are the foundation of data-driven GTM operations. RevOps teams use warehouses to combine CRM data with product usage, marketing attribution, and financial metrics. Reverse ETL tools like Census and Hightouch push warehouse data back into CRM and marketing tools, creating a feedback loop between analytics and operations. Without a warehouse, each team operates on siloed data.",
      "example": "A B2B company sends Salesforce CRM data, HubSpot marketing data, Stripe billing data, and product analytics to Snowflake via Fivetran. The data team builds models that identify expansion-ready accounts. Census pushes these insights back to Salesforce as account scores, and marketing uses them to trigger targeted campaigns in HubSpot.",
      "related_terms": [
        "reverse-etl",
        "data-orchestration",
        "customer-data-platform"
      ],
      "related_tools": [
        "fivetran",
        "census-data",
        "hightouch",
        "airbyte"
      ],
      "category_slug": "data-quality"
    },
    {
      "slug": "sales-pipeline",
      "term": "Sales Pipeline",
      "short_definition": "A visual representation of where prospects are in the sales process, from initial contact to closed deal.",
      "full_definition": "A sales pipeline maps the stages a prospect moves through before becoming a customer. Typical B2B pipeline stages: prospecting, qualification (BANT or MEDDIC), discovery/demo, proposal, negotiation, and closed-won/lost. Pipeline management involves tracking deal values, stage durations, conversion rates between stages, and pipeline velocity. CRM tools (Salesforce, HubSpot, Pipedrive) visualize the pipeline, while sales engagement tools (Salesloft, Outreach) drive prospects through it.",
      "why_it_matters": "Pipeline is the leading indicator of revenue. Sales leaders use pipeline metrics (coverage ratio, velocity, conversion rates) to forecast quarterly results and identify bottlenecks. A healthy pipeline typically has 3-5x coverage of quota. Data tools impact every pipeline stage: enrichment tools improve qualification, intent data prioritizes outreach, and revenue intelligence tools (Gong) identify deal risks.",
      "example": "A VP of Sales reviews the pipeline: $2M in deals across 40 opportunities. Average deal size is $50K, win rate is 25%, and average cycle length is 90 days. To hit a $500K quarterly target, they need $2M in pipeline (4x coverage). The team uses ZoomInfo to build prospecting lists, Salesloft to run outreach sequences, and Gong to coach reps on discovery calls that aren't converting.",
      "related_terms": [
        "lead-scoring",
        "sales-engagement",
        "buyer-journey",
        "revops"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "pipedrive",
        "salesloft"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "icp",
      "term": "Ideal Customer Profile (ICP)",
      "short_definition": "A detailed description of the type of company that's the best fit for your product or service.",
      "full_definition": "An Ideal Customer Profile defines the firmographic, technographic, and behavioral characteristics of companies most likely to buy, get value from, and retain your product. Unlike buyer personas (which describe individuals), ICPs describe organizations. A well-built ICP includes industry, company size, revenue range, tech stack, buying process, pain points, and common use cases. Most B2B companies start with a broad target and narrow their ICP as they collect data on which customers have the highest LTV and lowest churn.",
      "why_it_matters": "Without a clear ICP, sales teams prospect randomly, marketing targets too broadly, and customer success gets stuck supporting poor-fit customers who churn. Every dollar spent on an account outside your ICP is a dollar wasted. The most efficient B2B companies define their ICP from data (not intuition), then align every GTM motion around it.",
      "example": "A sales engagement platform defines its ICP: B2B SaaS companies, 50-500 employees, $10M-$100M ARR, headquartered in the US, with at least 10 SDRs, currently using Salesforce. That definition narrows their total addressable market from millions of companies to roughly 3,000, which lets their sales team focus outreach and marketing invest budget efficiently.",
      "related_terms": [
        "firmographic-data",
        "lead-scoring",
        "abm"
      ],
      "related_tools": [
        "zoominfo",
        "apollo",
        "6sense",
        "clearbit"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "mql-sql",
      "term": "MQL & SQL (Marketing and Sales Qualified Leads)",
      "short_definition": "Lead qualification stages that define when marketing hands a lead to sales (MQL) and when sales confirms it's worth pursuing (SQL).",
      "full_definition": "An MQL (Marketing Qualified Lead) is a lead that has engaged with marketing content enough to be considered a potential buyer. Engagement signals include downloading a whitepaper, attending a webinar, visiting the pricing page multiple times, or matching firmographic criteria. An SQL (Sales Qualified Lead) is an MQL that sales has vetted through direct conversation and confirmed has budget, authority, need, and timeline (BANT) for a purchase. The MQL-to-SQL handoff is one of the most critical (and most broken) processes in B2B organizations.",
      "why_it_matters": "MQL and SQL definitions create the shared language between marketing and sales. When these definitions are vague or misaligned, marketing sends garbage leads to sales, sales ignores them, and both teams blame each other. Clear, data-driven MQL/SQL criteria improve conversion rates and reduce friction between teams. The MQL-to-SQL conversion rate is also one of the best indicators of whether marketing is targeting the right audience.",
      "example": "A company defines MQL criteria: visited the pricing page twice, works at a company with 50+ employees, and has a VP or C-level title. When a lead meets all three criteria, it's routed to an SDR. The SDR qualifies it via a discovery call: if the prospect has confirmed budget, a timeline, and is the decision-maker, it becomes an SQL and gets a demo on the calendar.",
      "related_terms": [
        "lead-scoring",
        "buyer-journey",
        "sales-pipeline",
        "lead-routing"
      ],
      "related_tools": [
        "hubspot",
        "salesforce",
        "marketo",
        "6sense"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "sales-forecasting",
      "term": "Sales Forecasting",
      "short_definition": "The process of estimating future sales revenue based on pipeline data, historical performance, and market conditions.",
      "full_definition": "Sales forecasting predicts how much revenue your sales team will close in a given period (month, quarter, year). Methods range from simple (gut feel, weighted pipeline) to complex (multi-variable regression, AI-driven models). Most B2B companies use weighted pipeline forecasting, which multiplies each deal's value by its probability of closing based on deal stage. More advanced approaches layer in historical win rates by rep, deal size, segment, and time-in-stage to produce more accurate predictions.",
      "why_it_matters": "Accurate forecasting drives every major business decision: hiring plans, marketing spend, product roadmap priorities, and cash flow management. Companies that consistently miss forecasts either over-hire (burning cash) or under-hire (missing growth). The CFO cares about forecast accuracy more than almost any other sales metric. In public companies, missing quarterly forecasts directly impacts stock price.",
      "example": "A sales team has $2M in pipeline for Q2. Their weighted forecast: $500K in commit (90% close rate = $450K), $800K in best case (50% = $400K), and $700K in pipeline (20% = $140K). Weighted forecast: $990K. The VP of Sales calls $950K to the board. Actual close: $920K. That's a 3% miss, which is excellent forecast accuracy.",
      "related_terms": [
        "sales-pipeline",
        "revops",
        "sales-cadence"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "gong-engage",
        "6sense"
      ],
      "category_slug": "crm",
      "related_roundups": [
        "best-revenue-intelligence-tools"
      ]
    },
    {
      "slug": "crm-hygiene",
      "term": "CRM Hygiene",
      "short_definition": "The practice of maintaining clean, accurate, and complete data in your CRM through regular audits, deduplication, and data standards.",
      "full_definition": "CRM hygiene covers everything that keeps your customer database accurate and usable: deduplicating records, standardizing field values, removing stale data, merging duplicate accounts, validating contact information, and enforcing data entry standards. B2B data decays at roughly 30% per year as people change jobs, companies merge, and contact information goes stale. Without active hygiene, your CRM becomes a liability instead of an asset.",
      "why_it_matters": "Bad CRM data cascades. Reps call wrong numbers. Marketing emails bounce. Lead scoring models produce garbage. Forecasts are built on phantom pipeline. Reporting becomes unreliable. The cost of bad data isn't just wasted time. It's every downstream decision that gets made based on wrong information. Studies estimate that bad data costs companies $12.9 million per year on average (Gartner).",
      "example": "A RevOps team runs a quarterly CRM hygiene process: merge 2,000 duplicate contacts, remove 500 records with invalid email addresses, standardize job titles across 10,000 records (so 'VP Sales' and 'Vice President of Sales' are the same), and update 800 company records that had stale employee count data. The result: lead scoring accuracy improves 15%, email bounce rate drops from 8% to 2%.",
      "related_terms": [
        "data-hygiene",
        "data-validation",
        "data-deduplication",
        "revops"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "demandtools",
        "zoominfo"
      ],
      "category_slug": "cleaning",
      "related_roundups": [
        "best-data-quality-tools"
      ]
    },
    {
      "slug": "multi-threading",
      "term": "Multi-Threading (Sales)",
      "short_definition": "The practice of building relationships with multiple stakeholders within a target account, not just a single champion.",
      "full_definition": "Multi-threading means engaging multiple contacts at different levels and functions within a prospect account. Instead of relying on one champion to shepherd your deal through internal approval, you build relationships with the economic buyer, technical evaluator, end users, and other influencers. The goal is to reduce single-point-of-failure risk: if your one contact leaves the company, changes roles, or loses political capital, a single-threaded deal dies. A multi-threaded deal survives.",
      "why_it_matters": "Gartner research shows that the average B2B buying group involves 6-10 decision-makers. Deals that are single-threaded (only one contact engaged) close at roughly half the rate of multi-threaded deals. When your champion goes on vacation, takes a new job, or gets overruled by a stakeholder you've never met, the deal stalls. Multi-threading is insurance against these scenarios and it shortens sales cycles because you're addressing objections from multiple angles simultaneously.",
      "example": "An AE selling a $200K CRM deal multi-threads by engaging: the VP of Sales (economic buyer), the Sales Ops Manager (technical evaluator), two SDR managers (end users), and the CFO (budget approver). When the VP of Sales gets promoted and the new VP wants to re-evaluate, the AE has five other relationships keeping the deal alive. A single-threaded AE would've lost the deal at that moment.",
      "related_terms": [
        "sales-pipeline",
        "abm",
        "sales-enablement",
        "buyer-journey"
      ],
      "related_tools": [
        "salesloft",
        "outreach-io",
        "linkedin-sales-navigator",
        "gong-engage"
      ],
      "category_slug": "sales-engagement"
    },
    {
      "slug": "churn-rate",
      "term": "Churn Rate",
      "short_definition": "The percentage of customers who stop using a product or cancel their subscription during a given time period.",
      "full_definition": "Churn rate measures customer attrition. Calculate it by dividing the number of customers lost during a period by the number at the start of that period. A SaaS company with 1,000 customers that loses 30 in a month has 3% monthly churn. There's also revenue churn (sometimes called dollar churn), which measures the revenue lost from cancellations and downgrades. Revenue churn matters more than logo churn because losing a $50K account hurts more than losing five $1K accounts.",
      "why_it_matters": "Churn is the silent killer of SaaS businesses. You can grow 20% annually but still shrink if your churn outpaces acquisition. A 5% monthly churn rate means you're replacing more than half your customer base every year. That's a leaky bucket no amount of new logos can fill. RevOps teams track churn to identify at-risk accounts early and intervene before cancellation.",
      "example": "A B2B SaaS company with $10M ARR and 8% annual gross revenue churn loses $800K in recurring revenue each year. Their expansion revenue (upsells, cross-sells) needs to exceed $800K just to break even before any net new customers.",
      "related_terms": [
        "arr-mrr",
        "sales-pipeline",
        "sales-forecasting"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "gong-engage"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "arr-mrr",
      "term": "ARR/MRR",
      "short_definition": "Annual Recurring Revenue (ARR) and Monthly Recurring Revenue (MRR) measure the predictable, recurring revenue from subscriptions.",
      "full_definition": "MRR is the total predictable revenue normalized to a monthly figure. ARR is MRR multiplied by 12. These metrics exclude one-time fees, professional services, and usage overages. There are several flavors: New MRR (from new customers), Expansion MRR (upsells and add-ons), Contraction MRR (downgrades), and Churned MRR (cancellations). Net New MRR combines all four. Investors and boards care about Net Revenue Retention (NRR), which is the percentage of ARR retained from existing customers including expansion and contraction.",
      "why_it_matters": "ARR and MRR are the heartbeat metrics of any subscription business. They tell you whether your revenue engine is accelerating or stalling. A company growing ARR at 50% year-over-year with 120% NRR is in fundamentally different shape than one growing at 50% with 80% NRR. The first is expanding within its base; the second is churning and replacing.",
      "example": "A company starts January with $1M MRR. During the month, they add $80K New MRR, $30K Expansion MRR, lose $15K to Contraction MRR, and $25K to Churned MRR. Their Net New MRR is $70K, ending January at $1.07M MRR ($12.84M ARR).",
      "related_terms": [
        "churn-rate",
        "sales-forecasting",
        "sales-pipeline"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "gong-engage"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "sales-velocity",
      "term": "Sales Velocity",
      "short_definition": "A formula that measures how quickly your sales team generates revenue, combining deal count, win rate, average deal size, and sales cycle length.",
      "full_definition": "Sales velocity = (Number of Opportunities x Win Rate x Average Deal Size) / Sales Cycle Length in Days. The result tells you how much revenue you generate per day. It's a composite metric that captures the health of your entire pipeline in one number. Improving any of the four variables increases velocity, but the highest-leverage move varies by company. Early-stage startups usually benefit most from increasing deal count; mature companies from improving win rate or deal size.",
      "why_it_matters": "Sales velocity gives you a single number to benchmark your pipeline efficiency. If velocity is increasing quarter over quarter, your revenue engine is getting more efficient. If it's flat or declining despite more pipeline, you have a conversion or cycle-time problem. RevOps teams use sales velocity to forecast more accurately and identify which stage of the funnel needs attention.",
      "example": "A team has 100 qualified opportunities, a 25% win rate, $40K average deal size, and a 60-day sales cycle. Their velocity is (100 x 0.25 x $40,000) / 60 = $16,667 per day. If they can shorten the cycle to 45 days with the same inputs, velocity jumps to $22,222 per day.",
      "related_terms": [
        "sales-pipeline",
        "sales-forecasting",
        "lead-scoring"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "gong-engage",
        "salesloft"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "account-mapping",
      "term": "Account Mapping",
      "short_definition": "The process of identifying and visualizing the key stakeholders, decision-makers, and influencers within a target account.",
      "full_definition": "Account mapping goes beyond knowing who your point of contact is. It's about understanding the full buying committee: who has budget authority, who influences the decision, who can block the deal, and who champions your product internally. In partner ecosystems, account mapping also refers to matching your prospect accounts against a partner's customer base to find mutual opportunities. Tools like Crossbeam and Reveal specialize in this partner-ecosystem flavor.",
      "why_it_matters": "B2B deals don't close because one person says yes. They stall because someone you never talked to says no. Account mapping forces sales teams to think beyond their single contact and systematically engage all stakeholders. For enterprise deals over $100K, mapping the buying committee isn't optional. It's the difference between deals that close and deals that ghost you after a great demo.",
      "example": "Your AE is working a $200K deal at a Fortune 500 company. The account map shows 8 stakeholders: the VP of Sales (economic buyer), Director of RevOps (technical evaluator), 2 Sales Managers (influencers), IT Security (potential blocker), CFO (final sign-off), a Salesforce Admin (end user), and an internal champion who brought you in. Without this map, your AE would have talked to 2-3 people and wondered why the deal stalled.",
      "related_terms": [
        "buying-committee",
        "multi-threading",
        "icp"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "linkedin-sales-navigator",
        "gong-engage"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "buying-committee",
      "term": "Buying Committee",
      "short_definition": "The group of people within a company who are involved in making a B2B purchase decision.",
      "full_definition": "The buying committee (sometimes called the decision-making unit or DMU) includes everyone who influences a purchase. Gartner research puts the average B2B buying group at 6-10 people. Each member plays a role: economic buyer (controls budget), technical evaluator (assesses fit), champion (advocates internally), influencer (shapes opinion), end user (will use the product daily), and blocker (raises objections or compliance concerns). The committee grows with deal size. A $10K tool might have 2-3 people involved. A $500K platform deal can involve 15+.",
      "why_it_matters": "Sales teams that sell to one person lose to competitors that sell to the committee. Multi-threading across the buying group isn't just a nice-to-have. Research from Gong shows that deals involving 3+ contacts on the buyer side close at 2x the rate of single-threaded deals. RevOps teams build processes and plays that systematically identify and engage each committee member throughout the sales cycle.",
      "example": "An SDR books a meeting with a Director of Marketing. During discovery, they learn the VP of Marketing, CMO, IT Director, and Procurement all need to approve vendors over $50K. The rep builds a champion strategy with the Director, creates a custom business case for the CMO, schedules a technical review with IT, and prepares procurement paperwork in advance. The deal closes in 45 days instead of the 90-day average.",
      "related_terms": [
        "account-mapping",
        "multi-threading",
        "icp",
        "sales-pipeline"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "linkedin-sales-navigator",
        "gong-engage",
        "6sense"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "net-revenue-retention",
      "term": "Net Revenue Retention (NRR)",
      "short_definition": "The percentage of recurring revenue retained from existing customers over a period, including expansion, contraction, and churn.",
      "full_definition": "Net revenue retention measures how much revenue you keep and grow from your existing customer base without counting new customer acquisition. It starts with your beginning-period recurring revenue and factors in upgrades (expansion), downgrades (contraction), and cancellations (churn). An NRR above 100% means your existing customers are spending more over time, even before adding new logos.",
      "why_it_matters": "NRR is the single best metric for evaluating the health of a SaaS or subscription business. Companies with NRR above 120% can grow even with zero new customer acquisition. Investors obsess over it because high NRR indicates strong product-market fit, effective upselling, and low churn. In B2B data tools specifically, NRR signals whether a tool becomes more embedded (and more valuable) over time or whether customers outgrow it.",
      "example": "A B2B data company starts Q1 with $1M in ARR from existing customers. During Q1, $80K in expansions (upgrades, additional seats), $20K in contractions (downgrades), and $30K in churned revenue. NRR = ($1M + $80K - $20K - $30K) / $1M = 103%. The existing customer base grew 3% without adding a single new customer.",
      "related_terms": [
        "arr-mrr",
        "churn-rate",
        "sales-pipeline"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "gong-engage"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "dark-funnel",
      "term": "Dark Funnel",
      "short_definition": "The buying activity and research that happens outside your trackable marketing channels, invisible to attribution tools.",
      "full_definition": "The dark funnel refers to all the buying research and decision-making that happens in places your analytics can't see: private Slack communities, word-of-mouth recommendations, podcast mentions, offline conversations, dark social sharing (copied links without UTM parameters), and private browsing. When a prospect fills out a demo request form, they've often done 70-80% of their research in channels that won't show up in your attribution model.",
      "why_it_matters": "The dark funnel challenges the way most B2B companies measure marketing effectiveness. If your attribution model only credits trackable touchpoints (paid ads, organic search, email clicks), you're undervaluing the channels that actually drive buying decisions. Communities, podcasts, peer recommendations, and private research shape purchasing behavior more than most companies realize. Understanding the dark funnel means accepting that you can't measure everything and adjusting your strategy accordingly.",
      "example": "A VP of RevOps hears about a data enrichment tool in a private Slack community. They Google it, read reviews on G2 (in incognito mode), ask peers in their network, listen to a podcast episode featuring the founder, and then visit the website directly to book a demo. Your attribution model credits 'Direct Traffic' as the source. The actual decision was influenced by community, word-of-mouth, G2, and a podcast, none of which show up in analytics.",
      "related_terms": [
        "buyer-intent",
        "buyer-journey",
        "intent-data",
        "gtm-strategy"
      ],
      "related_tools": [
        "6sense",
        "common-room",
        "g2",
        "bombora"
      ],
      "category_slug": "intent"
    },
    {
      "slug": "signal-based-selling",
      "term": "Signal-Based Selling",
      "short_definition": "A sales approach that uses real-time buying signals to prioritize outreach and personalize messaging based on prospect behavior.",
      "full_definition": "Signal-based selling replaces spray-and-pray outbound with data-driven prioritization. Instead of working through static lists, sales reps focus on accounts showing buying signals: website visits, job postings for related roles, technology changes, funding events, intent data surges, content consumption, and social engagement. The signals come from tools like 6sense, Bombora, Common Room, and LinkedIn, and they tell reps which accounts to call and what to say.",
      "why_it_matters": "Cold outbound response rates have cratered below 1-2% for most B2B companies. Signal-based selling recovers response rates by ensuring reps reach out to prospects at the right time with relevant context. The shift from list-based to signal-based outbound is one of the biggest changes in B2B sales methodology in the past five years. Companies that adopt it consistently report 2-3x improvements in meeting booking rates.",
      "example": "Your signal stack detects that Acme Corp posted 3 RevOps job openings, visited your pricing page twice this week, and showed intent data spikes for 'data enrichment tools' on Bombora. Your SDR gets an alert with this context and crafts a personalized outreach referencing Acme's hiring growth and the specific use case the intent data suggests. This converts at 5-10x the rate of a generic cold email.",
      "related_terms": [
        "buyer-intent",
        "intent-data",
        "sales-engagement",
        "icp"
      ],
      "related_tools": [
        "6sense",
        "common-room",
        "bombora",
        "clay",
        "rb2b"
      ],
      "category_slug": "intent"
    },
    {
      "slug": "conversation-intelligence",
      "term": "Conversation Intelligence",
      "short_definition": "Technology that records, transcribes, and analyzes sales conversations to surface coaching insights and deal intelligence.",
      "full_definition": "Conversation intelligence platforms automatically record and transcribe sales calls, demos, and meetings, then use AI to analyze the conversation for coaching insights. The analysis includes talk-to-listen ratio, question frequency, filler word usage, competitor mentions, pricing discussions, next step commitments, and sentiment patterns. Advanced platforms correlate conversation patterns with deal outcomes to identify what top reps do differently.",
      "why_it_matters": "Before conversation intelligence, sales coaching was based on ride-alongs and anecdotal feedback. Managers could listen to a handful of calls per week. Now, every call is analyzed automatically, and coaching insights are data-driven. The technology also creates organizational knowledge: when a top rep leaves, their conversation patterns and techniques are captured in the system. For RevOps teams, conversation data enriches pipeline forecasting with qualitative signals.",
      "example": "Gong analyzes 500 sales calls from your team and identifies that deals where reps ask 11-14 questions close at 2x the rate of deals where they ask fewer than 7. It also flags that your top closer spends 35% of the call listening, while struggling reps talk 70% of the time. The manager uses these insights to build a coaching program focused on discovery question frameworks.",
      "related_terms": [
        "sales-enablement",
        "sales-velocity",
        "sales-engagement"
      ],
      "related_tools": [
        "gong-engage",
        "zoominfo",
        "salesloft",
        "outreach-io"
      ],
      "category_slug": "list-building",
      "related_roundups": [
        "best-conversation-intelligence-tools"
      ]
    },
    {
      "slug": "deal-desk",
      "term": "Deal Desk",
      "short_definition": "A centralized function that manages complex deal approvals, pricing exceptions, and contract negotiations for non-standard sales transactions.",
      "full_definition": "A deal desk is a cross-functional team (typically spanning sales ops, finance, and legal) that handles deals requiring special approval: non-standard pricing, custom terms, multi-year contracts, large discounts, or complex product configurations. The deal desk standardizes the approval process, ensures pricing consistency, and accelerates deal velocity by providing a single point of contact for reps who need exceptions. In practice, most deal desks manage the top 20-30% of deals by complexity.",
      "why_it_matters": "Without a deal desk, complex deals bounce between sales, finance, and legal in email threads that add days or weeks to the sales cycle. Pricing becomes inconsistent as different reps negotiate different terms. Margin erosion happens silently because no one has visibility into the cumulative impact of discounts. A deal desk brings structure to chaos: standard approval workflows, pricing guardrails, and data on what terms win and what gives away too much.",
      "example": "An enterprise AE closes a deal with a Fortune 500 account that requires custom payment terms (quarterly instead of annual), a 25% volume discount, and a custom SLA. Instead of emailing finance, legal, and their VP separately, they submit a deal desk request with the terms. The deal desk reviews against pricing guidelines, suggests counter-terms that protect margin, routes for VP approval, and returns an approved deal structure within 24 hours.",
      "related_terms": [
        "sales-pipeline",
        "sales-velocity",
        "sales-forecasting",
        "arr-mrr"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "dynamics-365"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "waterfall-enrichment",
      "term": "Waterfall Enrichment",
      "short_definition": "A data enrichment strategy that queries multiple data providers in sequence, using the best result from each.",
      "full_definition": "Waterfall enrichment (sometimes called data waterfalling or cascade enrichment) queries multiple B2B data providers in a prioritized sequence for each record. Instead of relying on a single provider, the system checks Provider A first. If Provider A doesn't return a result (or returns low-confidence data), it falls through to Provider B, then Provider C, and so on. The first high-quality match is used, combining coverage from multiple sources without paying for redundant lookups.",
      "why_it_matters": "No single B2B data provider covers every contact accurately. ZoomInfo might have strong coverage for enterprise tech companies but weaker data for SMBs. Apollo might fill the SMB gap. Waterfalling across both gives you better overall coverage than either alone. Teams using waterfall enrichment typically see 20-40% improvement in match rates compared to single-provider approaches.",
      "example": "You have 5,000 leads that need email enrichment. Your waterfall: query ZoomInfo first (matches 3,200). Send the remaining 1,800 to Apollo (matches 1,100). Send the remaining 700 to Clearbit (matches 400). Final result: 4,700 enriched records (94%) vs. 3,200 (64%) from ZoomInfo alone. Clay automates this entire process in a single workflow.",
      "related_terms": [
        "data-enrichment",
        "data-orchestration",
        "data-validation"
      ],
      "related_tools": [
        "clay",
        "zoominfo",
        "apollo",
        "clearbit"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "sales-ops-vs-revops",
      "term": "Sales Ops vs RevOps",
      "short_definition": "Sales ops focuses on sales team efficiency. RevOps aligns sales, marketing, and customer success operations under one umbrella.",
      "full_definition": "Sales Operations (Sales Ops) is the function that supports the sales team with process optimization, territory planning, compensation design, CRM administration, and analytics. Revenue Operations (RevOps) is the evolution of Sales Ops that extends the same operational discipline across the entire revenue engine: sales, marketing, and customer success. RevOps breaks down silos between these teams by unifying data, processes, and technology under a single operational leader.",
      "why_it_matters": "Companies with siloed sales, marketing, and customer success operations end up with inconsistent data, misaligned handoffs, and blind spots in the customer journey. RevOps addresses this by creating a single source of truth across all revenue-generating functions. Forrester research shows companies with aligned revenue operations grow 12-15% faster than those with siloed ops functions.",
      "example": "In a Sales Ops model, the sales ops team manages Salesforce, while marketing ops manages HubSpot, and CS ops manages Gainsight. Each team has its own data, definitions, and reporting. In a RevOps model, one team manages all three systems with unified definitions (what counts as an MQL, SQL, and customer), shared dashboards, and end-to-end pipeline visibility.",
      "related_terms": [
        "revops",
        "sales-pipeline",
        "sales-forecasting",
        "crm-hygiene"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "salesloft",
        "clay"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "composable-cdp",
      "term": "Composable CDP",
      "short_definition": "A Customer Data Platform architecture that runs on your existing data warehouse instead of copying data into a separate system.",
      "full_definition": "A composable CDP (Customer Data Platform) lets you build CDP functionality on top of your existing data warehouse (Snowflake, BigQuery, Databricks) instead of ingesting data into a standalone CDP platform. Tools like Census and Hightouch act as the activation layer, syncing audience segments and customer profiles from your warehouse directly to marketing and sales tools. The 'composable' part means you pick best-of-breed components (warehouse for storage, reverse ETL for activation, identity resolution from another vendor) instead of buying a monolithic CDP.",
      "why_it_matters": "Traditional CDPs (Segment, mParticle, Treasure Data) require you to copy all your customer data into their platform. This creates data duplication, sync issues, and vendor lock-in. Composable CDPs flip this by treating your warehouse as the single source of truth. Your data stays in one place. You avoid paying a CDP vendor to store data you already have. And your data team maintains control over data models and transformations.",
      "example": "Instead of sending all your customer events to Segment ($120K+/year), you land them in Snowflake, build audience segments with dbt, and use Hightouch to sync those segments to HubSpot, Facebook Ads, and Intercom. The warehouse already has the data. Hightouch activates it. Total cost: Snowflake + Hightouch, often 50-70% less than a traditional CDP.",
      "related_terms": [
        "customer-data-platform",
        "reverse-etl",
        "data-warehouse"
      ],
      "related_tools": [
        "census-data",
        "hightouch"
      ],
      "category_slug": "reverse-etl"
    },
    {
      "slug": "account-scoring",
      "term": "Account Scoring",
      "short_definition": "A methodology for ranking target accounts based on their fit and likelihood to buy, used in ABM and enterprise sales.",
      "full_definition": "Account scoring applies numerical values to companies (not individual leads) based on two dimensions: fit score (how closely the company matches your ideal customer profile) and engagement score (how actively the account is interacting with your brand or researching your category). Fit scoring uses firmographic data: industry, revenue, employee count, technology stack, and growth signals. Engagement scoring uses behavioral data: website visits, content downloads, ad interactions, intent signals, and sales touchpoints. The combined score helps sales and marketing teams prioritize which accounts to focus on.",
      "why_it_matters": "Enterprise sales teams can't work every account equally. Account scoring surfaces the accounts most likely to convert, reducing wasted effort on poor-fit companies. ABM programs use account scores to determine advertising spend allocation, sales outreach priority, and executive engagement. Companies with mature account scoring models report 30-50% improvement in sales productivity by focusing reps on high-scoring accounts.",
      "example": "Your ICP is SaaS companies with 200-2,000 employees and $20M+ ARR. A company matching this profile gets a fit score of 85/100. 6sense detects they've been researching 'CRM migration' with 15 employees showing buying intent. Their engagement score jumps to 90/100. Combined score: 175/200. This account goes to the top of your sales team's priority list.",
      "related_terms": [
        "lead-scoring",
        "icp",
        "abm",
        "intent-data",
        "buying-committee"
      ],
      "related_tools": [
        "6sense",
        "demandbase",
        "salesforce"
      ],
      "category_slug": "abm"
    },
    {
      "slug": "data-lakehouse",
      "term": "Data Lakehouse",
      "short_definition": "A data architecture that combines the low-cost storage of data lakes with the structured querying and performance of data warehouses.",
      "full_definition": "A data lakehouse merges two previously separate architectures: data lakes (cheap storage for raw, unstructured data) and data warehouses (structured, optimized storage for analytics queries). The lakehouse stores data in open formats (Parquet, Delta Lake, Iceberg) on object storage (S3, GCS, ADLS) while providing the ACID transactions, schema enforcement, and query performance traditionally associated with data warehouses. Databricks popularized the term and architecture, but Snowflake, BigQuery, and others have adopted similar concepts.",
      "why_it_matters": "Before lakehouses, companies maintained separate data lakes (for raw data and ML workloads) and data warehouses (for BI and analytics). This created data duplication, sync complexity, and higher costs. The lakehouse eliminates the need for two systems by providing warehouse-quality performance on lake-stored data. For B2B data operations, this means your enrichment data, intent signals, and CRM exports can live in one system that serves both analytics and machine learning workloads.",
      "example": "A B2B company stores raw job posting data, website visitor logs, and CRM exports in a Delta Lake on S3. The data team runs SQL queries against this data using Databricks SQL for pipeline analytics and dashboards. The data science team trains intent prediction models on the same data using Spark. One storage layer serves both use cases without moving data between systems.",
      "related_terms": [
        "data-warehouse",
        "data-orchestration",
        "reverse-etl"
      ],
      "related_tools": [
        "fivetran",
        "airbyte",
        "hightouch",
        "census-data"
      ],
      "category_slug": "data-integration"
    },
    {
      "slug": "data-mesh",
      "term": "Data Mesh",
      "short_definition": "A decentralized data architecture where domain teams own and manage their own data products.",
      "full_definition": "Data mesh is an organizational and architectural approach that shifts data ownership from a central data team to the domain teams that produce it. Sales, marketing, product, and finance each own their data, publishing it as a product with defined interfaces, quality standards, and SLAs. It's a direct reaction to the bottleneck that forms when a single central data team can't keep up with requests from every corner of the business.",
      "why_it_matters": "Central data teams become bottlenecks. Every dashboard request, every schema change, every new report sits in a queue. Data mesh distributes that ownership so each team moves at its own pace. But it's not free. It requires strong governance, self-serve infrastructure, and a culture shift where domain teams accept responsibility for data quality.",
      "example": "Instead of the data team building every Salesforce report and marketing dashboard, each team owns their domain's data products. Sales ops publishes pipeline data with defined schemas. Marketing publishes campaign attribution data. Both are queryable through a shared data catalog.",
      "related_terms": [
        "data-lakehouse",
        "composable-cdp",
        "revops"
      ],
      "related_tools": [
        "fivetran",
        "airbyte",
        "census-data",
        "hightouch"
      ],
      "category_slug": "orchestration"
    },
    {
      "slug": "zero-party-data",
      "term": "Zero-Party Data",
      "short_definition": "Data that a customer intentionally and proactively shares with a brand, like preferences, survey responses, and purchase intentions.",
      "full_definition": "Unlike first-party data (observed behavior) or third-party data (purchased from external sources), zero-party data is what customers tell you directly. Survey responses. Preference center selections. Quiz results. Explicitly stated purchase intent. Forrester coined the term in 2020 to distinguish this voluntarily shared information from data you collect through tracking or buy from vendors.",
      "why_it_matters": "With third-party cookies dying and privacy regulations tightening, zero-party data is becoming the most reliable personalization input. It's also the most accurate because the customer provided it voluntarily. The challenge is creating enough value exchange to get people to share it. Nobody fills out a 20-question survey for fun.",
      "example": "A CRM vendor's website quiz asks \"How many sales reps does your team have?\" and \"What's your biggest CRM pain point?\" The visitor answers willingly because they expect relevant recommendations in return. That data is more accurate than any third-party enrichment.",
      "related_terms": [
        "intent-data",
        "lead-scoring",
        "buyer-journey"
      ],
      "related_tools": [
        "hubspot",
        "salesforce",
        "mutiny"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "revenue-attribution",
      "term": "Revenue Attribution",
      "short_definition": "The process of connecting closed revenue back to the marketing and sales touchpoints that influenced the deal.",
      "full_definition": "Revenue attribution answers a straightforward question: which marketing campaigns and sales activities contributed to this deal closing? It goes beyond lead attribution (which channel generated the lead) to track the full buyer journey across multiple touchpoints. Common models include first-touch, last-touch, linear, time-decay, and data-driven or algorithmic attribution. Each model distributes credit differently, and no single model is perfect.",
      "why_it_matters": "Without attribution, marketing can't prove ROI and sales can't identify which activities move deals forward. It determines budget allocation. Teams that can attribute revenue to specific channels and campaigns make better investment decisions. Teams that can't end up funding whatever the loudest executive believes is working.",
      "example": "A $100K deal closes. Revenue attribution shows the buyer first found you through an SEO blog post, attended a webinar, received three outbound emails from the SDR, saw two LinkedIn ads, and had a final demo from the AE. How much credit does each touchpoint get? That's the attribution question.",
      "related_terms": [
        "pipeline-velocity",
        "sales-forecasting",
        "mql-sql"
      ],
      "related_tools": [
        "hubspot",
        "salesforce",
        "marketo",
        "6sense"
      ],
      "category_slug": "data-quality"
    },
    {
      "slug": "pipeline-velocity",
      "term": "Pipeline Velocity",
      "short_definition": "A metric that measures how fast revenue moves through your sales pipeline, calculated as (opportunities × win rate × average deal size) / sales cycle length.",
      "full_definition": "Pipeline velocity combines four factors into one number: the number of qualified opportunities in your pipeline, your win rate, your average deal size, and the average length of your sales cycle. The formula is (Opportunities × Win Rate × Avg Deal Size) / Sales Cycle Days. It gives you a dollar-per-day figure that represents how much revenue your pipeline generates daily.",
      "why_it_matters": "Pipeline velocity is one of the best single metrics for sales performance. It accounts for both volume (how many deals) and efficiency (how fast they close). Improving any of the four inputs increases velocity. It's more useful than pipeline coverage alone because it factors in speed and conversion, not just total dollar amount sitting in the funnel.",
      "example": "Your team has 50 qualified opportunities, a 25% win rate, $40K average deal size, and 60-day sales cycle. Pipeline velocity = (50 × 0.25 × $40,000) / 60 = $8,333/day. If you shorten the sales cycle to 45 days without changing anything else, velocity jumps to $11,111/day.",
      "related_terms": [
        "sales-velocity",
        "sales-forecasting",
        "sales-pipeline"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "gong-engage",
        "salesloft"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "sales-territory-planning",
      "term": "Sales Territory Planning",
      "short_definition": "The process of dividing your total addressable market into defined territories assigned to specific sales reps or teams.",
      "full_definition": "Sales territory planning segments your market by geography, industry, company size, product line, or account tier, then assigns those segments to reps. Good territory design balances opportunity across the team so no rep is overloaded while another starves. It directly impacts quota attainment, rep retention, and revenue predictability. Most companies redo territories annually, and it's a major operational lift every time.",
      "why_it_matters": "Poorly designed territories kill morale and revenue. If one rep has 500 accounts and another has 50 enterprise accounts worth 10x the pipeline, you'll lose the overloaded rep and under-challenge the other. Territory planning also prevents account conflicts, double-coverage, and customer confusion about who their point of contact is.",
      "example": "A 20-person sales team covers North America. Instead of splitting purely by geography (which creates uneven opportunity), you segment by company size and industry: 5 reps cover enterprise accounts nationally, 10 reps cover mid-market by region, and 5 reps handle SMB through an inbound model. Each territory targets roughly equal pipeline potential.",
      "related_terms": [
        "sales-ops-vs-revops",
        "account-mapping",
        "icp"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "dynamics-365"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "data-clean-room",
      "term": "Data Clean Room",
      "short_definition": "A secure environment where multiple parties can share and analyze combined datasets without exposing raw data to each other.",
      "full_definition": "A data clean room is a privacy-safe technology that lets two or more organizations combine their first-party datasets for analysis without either party seeing the other's raw data. The clean room enforces strict access controls: you can run aggregate queries and build audience segments, but you can't export individual-level records. Major providers include Google Ads Data Hub, AWS Clean Rooms, Snowflake Data Clean Rooms, and LiveRamp. The concept borrows from pharmaceutical research, where \"clean rooms\" prevent contamination.",
      "why_it_matters": "With third-party cookies dying and privacy regulations tightening, data clean rooms are becoming the primary way brands and publishers collaborate on audience targeting. They let you answer questions like \"how many of our CRM contacts saw Partner X's ads?\" without sharing your customer list. For B2B, clean rooms enable co-marketing measurement and joint account targeting between tech partners.",
      "example": "A SaaS company and a media publisher set up a Snowflake Clean Room. The SaaS company loads their CRM account list. The publisher loads their subscriber data. The clean room matches records and returns aggregate overlap metrics (\"340 of your target accounts are active subscribers\") without either party accessing the other's full dataset.",
      "related_terms": [
        "zero-party-data",
        "customer-data-platform",
        "data-governance"
      ],
      "related_tools": [],
      "category_slug": "enrichment"
    },
    {
      "slug": "product-qualified-lead",
      "term": "Product-Qualified Lead (PQL)",
      "short_definition": "A potential customer who has demonstrated purchase intent through actual product usage, not just marketing engagement.",
      "full_definition": "A product-qualified lead is someone who's used your product (typically through a free trial or freemium plan) and hit behavioral thresholds that indicate they're likely to convert to a paid customer. PQLs are defined by product usage patterns: features used, frequency of login, team members invited, integrations connected, or data volume processed. The concept emerged from product-led growth (PLG) companies where users adopt the product before talking to sales.",
      "why_it_matters": "PQLs convert at 2-5x the rate of marketing-qualified leads because they've already experienced the product's value. For PLG companies, PQLs are the primary pipeline source. The challenge is defining the right PQL criteria: which usage patterns actually predict conversion? This requires tight integration between product analytics (Pendo, Amplitude, Mixpanel) and CRM (HubSpot, Salesforce).",
      "example": "A project management SaaS defines a PQL as a free user who has created 3+ projects, invited 2+ team members, and used the product for 14+ days. When a user hits all three criteria, the CRM flags them as a PQL and triggers a sales notification.",
      "related_terms": [
        "product-led-growth",
        "lead-scoring",
        "mql-sql",
        "buyer-journey"
      ],
      "related_tools": [
        "hubspot",
        "salesforce"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "sales-signal",
      "term": "Sales Signal",
      "short_definition": "Any data point or event that indicates a prospect or account may be ready to buy.",
      "full_definition": "A sales signal is a trigger event or behavioral indicator that suggests a prospect is entering an active buying cycle. Signals come from multiple sources: job postings (company hiring for a relevant role), technographic changes (company adopted a competitor's tool), intent data (researching your category), website visits (pricing page views), and firmographic changes (new funding round, leadership change). Modern sales intelligence platforms aggregate these signals to help reps prioritize outreach.",
      "why_it_matters": "Cold outreach converts at 1-2%. Signal-based outreach can hit 5-15% response rates because you're reaching companies at the right moment. The shift from \"spray and pray\" to signal-based selling is the biggest change in outbound sales methodology in the past five years. Companies like 6sense, Common Room, and RB2B are built entirely around capturing and surfacing these signals.",
      "example": "Your sales intelligence tool detects that a target account just posted a job for \"Revenue Operations Manager\" requiring Salesforce experience. Your competitor analysis shows they're currently on HubSpot. You reach out with a message about migration support, timed to their apparent platform evaluation.",
      "related_terms": [
        "signal-based-selling",
        "intent-data",
        "buyer-intent",
        "account-scoring"
      ],
      "related_tools": [
        "6sense",
        "common-room",
        "rb2b",
        "bombora"
      ],
      "category_slug": "intent"
    },
    {
      "slug": "account-intelligence",
      "term": "Account Intelligence",
      "short_definition": "Comprehensive data about a target company, including firmographics, technographics, intent signals, and organizational structure.",
      "full_definition": "Account intelligence is the aggregation of all available data about a target company into a unified view that sales and marketing teams can act on. It goes beyond basic firmographics (size, industry, revenue) to include technology stack, recent news, hiring patterns, funding events, leadership changes, competitive tool usage, and intent signals. The best account intelligence combines multiple data sources into a single prioritized account score or profile.",
      "why_it_matters": "Account intelligence determines sales efficiency. Without it, reps waste time on poorly-fit accounts and miss buying signals from high-potential targets. With it, teams can focus outreach on accounts most likely to convert, personalize messaging with relevant details, and time outreach to buying triggers. The difference between a rep who has account intelligence and one who doesn't is the difference between research-driven selling and random dialing.",
      "example": "Before a discovery call, your account intelligence platform shows: Acme Corp (500 employees, $80M revenue, Series D). Tech stack includes Salesforce, Marketo, and a competitor's product. They posted 3 SDR roles last month. Two decision-makers recently viewed your pricing page. They've been researching your category on G2. This context shapes every aspect of your approach.",
      "related_terms": [
        "firmographic-data",
        "technographic-data",
        "intent-data",
        "sales-intelligence",
        "account-scoring"
      ],
      "related_tools": [
        "zoominfo",
        "6sense",
        "demandbase",
        "apollo",
        "cognism"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "data-governance",
      "term": "Data Governance",
      "short_definition": "The framework of policies, processes, and standards that ensure data is accurate, secure, compliant, and consistently managed across an organization.",
      "full_definition": "Data governance is the organizational discipline that defines who can access what data, how data quality is maintained, where data lives, and how it complies with regulations like GDPR, CCPA, and HIPAA. It covers data ownership (who's responsible for each dataset), data quality standards (validation rules, deduplication processes), access controls (role-based permissions), data lineage (tracking where data came from and how it was transformed), and retention policies (how long data is kept and when it's deleted).",
      "why_it_matters": "Poor data governance leads to three expensive problems: compliance violations (GDPR fines can reach 4% of global revenue), bad decisions based on dirty data, and duplicated effort across teams working with different versions of the truth. As companies adopt more data tools and collect more customer information, governance becomes the difference between a data-driven organization and a data-chaotic one.",
      "example": "A B2B company implements data governance by: designating Marketing Ops as the owner of lead data, requiring all tools to sync through a central CDP, creating deduplication rules that run nightly, setting 24-month retention limits on prospect data for GDPR compliance, and establishing a data dictionary that defines how \"customer\" and \"prospect\" are classified across Salesforce, HubSpot, and their data warehouse.",
      "related_terms": [
        "data-hygiene",
        "crm-hygiene",
        "data-validation",
        "data-mesh",
        "data-clean-room"
      ],
      "related_tools": [],
      "category_slug": "data-quality"
    }
  ]
}