{
  "terms": [
    {
      "slug": "data-enrichment",
      "term": "Data Enrichment",
      "short_definition": "The process of appending additional data points to existing records in your CRM or database.",
      "full_definition": "Data enrichment takes your existing contacts, leads, or accounts and fills in missing information. That might mean appending firmographic data (company size, revenue, industry), demographic data (job title, email, phone), technographic data (what software they use), or intent signals (what topics they're researching).",
      "why_it_matters": "Without enrichment, your CRM is full of half-complete records. Sales reps waste time researching prospects manually, marketing can't segment effectively, and lead scoring models don't have enough signals to work with. Enrichment automates what used to be hours of manual research.",
      "example": "You import 500 leads from a webinar. Each record has a name and email. An enrichment tool like ZoomInfo or Clearbit appends company name, size, industry, title, phone number, and technology stack to each record automatically.",
      "related_terms": [
        "firmographic-data",
        "technographic-data",
        "intent-data"
      ],
      "related_tools": [
        "zoominfo",
        "clearbit",
        "apollo",
        "clay"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "intent-data",
      "term": "Intent Data",
      "short_definition": "Behavioral signals that indicate a company or person is actively researching a specific topic or solution.",
      "full_definition": "Intent data captures online research behavior across the web, including content consumption, search queries, product review visits, and competitor page views. There are two types: first-party intent (tracked on your own website via tools like 6sense or Warmly) and third-party intent (aggregated from publisher networks, review sites, and content platforms like Bombora or TechTarget).",
      "why_it_matters": "Intent data lets sales and marketing teams prioritize accounts that are actively in-market for their solution. Instead of spraying outreach to cold lists, you can focus on companies that are already researching your category. This improves conversion rates and reduces wasted effort.",
      "example": "6sense detects that Acme Corp has had 12 employees researching 'data enrichment tools' and 'ZoomInfo alternatives' in the past two weeks. Your sales team gets an alert to prioritize Acme in their outreach cadence.",
      "related_terms": [
        "abm",
        "data-enrichment",
        "lead-scoring"
      ],
      "related_tools": [
        "6sense",
        "bombora",
        "warmly"
      ],
      "category_slug": "intent"
    },
    {
      "slug": "abm",
      "term": "Account-Based Marketing (ABM)",
      "short_definition": "A B2B marketing strategy that focuses on targeted accounts rather than broad-based lead generation.",
      "full_definition": "ABM flips the traditional marketing funnel. Instead of casting a wide net and qualifying leads down to accounts, ABM starts with a defined list of target accounts and directs personalized marketing and sales efforts at those specific companies. It requires tight alignment between sales and marketing teams, shared account lists, and coordinated multi-channel outreach.",
      "why_it_matters": "For companies selling high-value deals to enterprise buyers, ABM is more efficient than inbound lead gen. It concentrates budget on accounts that match your ideal customer profile, which typically produces higher win rates and larger deal sizes. Research consistently shows ABM programs outperform traditional demand gen for enterprise sales motions.",
      "example": "Your marketing team identifies 200 target accounts based on firmographic fit and intent signals. They run LinkedIn ads, direct mail, and personalized email campaigns specifically to contacts at those 200 companies, while sales runs outbound cadences to the same list.",
      "related_terms": [
        "intent-data",
        "lead-scoring",
        "firmographic-data"
      ],
      "related_tools": [
        "6sense"
      ],
      "category_slug": "abm"
    },
    {
      "slug": "firmographic-data",
      "term": "Firmographic Data",
      "short_definition": "Descriptive attributes about a company, such as industry, revenue, employee count, and location.",
      "full_definition": "Firmographics are to companies what demographics are to individuals. They describe the characteristics of a business: industry, annual revenue, number of employees, headquarters location, funding stage, and organizational structure. This data is foundational for lead scoring, market segmentation, and ideal customer profile (ICP) definition.",
      "why_it_matters": "Firmographic data is the first filter in any B2B targeting strategy. You can't sell enterprise software to a 5-person startup (or shouldn't be trying to). Firmographics help sales and marketing teams qualify accounts before any outreach begins.",
      "example": "Your ICP is SaaS companies with 200-2,000 employees and $20M+ ARR. Firmographic data from ZoomInfo or Apollo lets you filter your prospecting list to only companies matching those criteria.",
      "related_terms": [
        "data-enrichment",
        "technographic-data",
        "lead-scoring"
      ],
      "related_tools": [
        "zoominfo",
        "apollo",
        "clearbit"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "technographic-data",
      "term": "Technographic Data",
      "short_definition": "Information about what technology products and platforms a company uses.",
      "full_definition": "Technographic data reveals a company's technology stack: what CRM they run, which marketing automation platform they use, their cloud provider, analytics tools, and more. This data is collected through web scraping (detecting JavaScript tags, DNS records, job postings), surveys, and partnership data from technology platforms.",
      "why_it_matters": "Knowing a prospect's tech stack tells you whether your product integrates with their existing tools, whether they're using a competitor, and what their technical maturity level is. A company running Salesforce Enterprise is a different buyer than one using a spreadsheet for CRM.",
      "example": "You sell a Salesforce integration. Technographic data reveals that 800 companies in your target market run Salesforce Enterprise. That's your addressable market. The 200 running HubSpot might be a secondary target if you build that integration.",
      "related_terms": [
        "firmographic-data",
        "data-enrichment",
        "intent-data"
      ],
      "related_tools": [
        "zoominfo",
        "clearbit"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "lead-scoring",
      "term": "Lead Scoring",
      "short_definition": "A methodology for ranking leads based on their likelihood to convert to a customer.",
      "full_definition": "Lead scoring assigns numerical values to leads based on two dimensions: fit (how closely they match your ideal customer profile) and engagement (how actively they're interacting with your brand). Fit scoring uses firmographic and demographic data. Engagement scoring uses behavioral data like email opens, website visits, content downloads, and product usage. Most CRMs and marketing automation platforms include lead scoring functionality.",
      "why_it_matters": "Without lead scoring, sales teams treat all leads equally. A VP at an enterprise company who visited your pricing page three times gets the same priority as a student who downloaded a whitepaper. Lead scoring eliminates this guesswork by quantifying which leads deserve immediate attention.",
      "example": "A lead scores 85/100 because they're a Director at a 500-person SaaS company (high fit), visited your pricing page twice, attended a webinar, and opened 4 emails (high engagement). They get routed to a senior AE immediately.",
      "related_terms": [
        "intent-data",
        "firmographic-data",
        "data-enrichment"
      ],
      "related_tools": [
        "hubspot",
        "salesforce",
        "6sense"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "data-hygiene",
      "term": "Data Hygiene",
      "short_definition": "The ongoing practice of maintaining clean, accurate, and up-to-date data in your CRM and databases.",
      "full_definition": "Data hygiene encompasses deduplication (merging duplicate records), standardization (normalizing formats for phone numbers, addresses, titles), validation (verifying emails and phone numbers are still active), decay management (identifying and updating stale records), and enrichment (filling in missing fields). It's not a one-time project. B2B data decays at roughly 30% per year as people change jobs, companies merge, and contact details change.",
      "why_it_matters": "Dirty data cascades through every downstream process. Bad emails increase bounce rates (hurting deliverability). Duplicate records create confusing customer experiences. Stale data wastes sales time on prospects who've already left the company. The cost of bad data compounds over time.",
      "example": "A quarterly data hygiene audit reveals 15% duplicate accounts, 22% of email addresses bouncing, and 8% of contacts listing a company they no longer work for. A cleanup project using DemandTools and a verification service fixes these issues.",
      "related_terms": [
        "data-enrichment",
        "data-validation"
      ],
      "related_tools": [
        "demandtools",
        "verum"
      ],
      "category_slug": "cleaning"
    },
    {
      "slug": "data-validation",
      "term": "Data Validation",
      "short_definition": "The process of verifying that data is accurate, complete, and in the correct format.",
      "full_definition": "Data validation checks whether data meets quality standards before it enters or stays in your system. Email validation confirms addresses are deliverable (syntax check, domain check, mailbox verification). Phone validation verifies numbers are active and reachable. Address validation standardizes and verifies physical addresses against postal databases. Field-level validation ensures data conforms to expected formats (e.g., phone numbers have the right number of digits).",
      "why_it_matters": "Sending emails to invalid addresses damages your sender reputation. Calling dead phone numbers wastes rep time. Bad addresses cause returned mail and failed deliveries. Validation at the point of entry prevents garbage data from getting into your system in the first place.",
      "example": "You integrate an email validation API into your web forms. When a visitor types 'john@gmial.com', the system catches the typo in real-time and suggests 'john@gmail.com' before the lead enters your CRM.",
      "related_terms": [
        "data-hygiene",
        "data-enrichment"
      ],
      "related_tools": [
        "demandtools",
        "verum"
      ],
      "category_slug": "validation"
    },
    {
      "slug": "revops",
      "term": "Revenue Operations (RevOps)",
      "short_definition": "A business function that aligns sales, marketing, and customer success operations to drive predictable revenue growth.",
      "full_definition": "RevOps breaks down the traditional silos between sales ops, marketing ops, and customer success ops. A RevOps team owns the end-to-end revenue process: lead management, pipeline operations, forecasting, tool administration, data governance, and reporting. The function emerged because companies realized that siloed ops teams create disconnected tech stacks, inconsistent data, and conflicting processes.",
      "why_it_matters": "RevOps is the fastest-growing ops function in B2B. Companies with dedicated RevOps teams report better pipeline visibility, more accurate forecasting, and higher conversion rates. The role has moved from a nice-to-have to a core function at most B2B companies with 50+ employees.",
      "example": "A RevOps team at a 200-person SaaS company manages the Salesforce CRM, HubSpot Marketing Hub, ZoomInfo enrichment pipeline, Gong conversation intelligence, and Salesloft cadences. They ensure data flows cleanly between all systems and report on full-funnel metrics.",
      "related_terms": [
        "lead-scoring",
        "data-hygiene",
        "abm"
      ],
      "related_tools": [
        "salesforce",
        "hubspot"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "sales-engagement",
      "term": "Sales Engagement",
      "short_definition": "Software platforms that help sales teams execute multi-channel outreach cadences at scale.",
      "full_definition": "Sales engagement platforms orchestrate outbound sales activity across email, phone, social, and direct mail channels. They provide cadence management (structured sequences of touches), email automation with personalization, power dialers, analytics, and CRM sync. The category sits between your CRM (system of record) and your communication tools (email, phone), automating the execution layer of outbound sales.",
      "why_it_matters": "Manual outbound doesn't scale. A sales rep can manage maybe 20-30 prospects by hand. A sales engagement platform lets them run structured cadences to 200+ prospects simultaneously while tracking every interaction. The data from these platforms also feeds coaching and process optimization.",
      "example": "An SDR creates a 14-day cadence in Salesloft with 5 emails, 3 phone calls, and 2 LinkedIn touchpoints. They enroll 50 new prospects daily. The platform automates email sends, queues calls, and tracks open/reply rates across the sequence.",
      "related_terms": [
        "revops",
        "lead-scoring"
      ],
      "related_tools": [
        "salesloft",
        "apollo",
        "instantly"
      ],
      "category_slug": "list-building"
    },
    {
      "slug": "customer-data-platform",
      "term": "Customer Data Platform (CDP)",
      "short_definition": "A platform that unifies customer data from multiple sources into a single, persistent profile.",
      "full_definition": "A customer data platform collects first-party data from your website, CRM, email tools, support tickets, and other touchpoints, then stitches it together into one record per person. Unlike a data warehouse, a CDP is built for activation. It's designed so marketing and sales teams can segment audiences and trigger campaigns without writing SQL or waiting on an analyst.",
      "why_it_matters": "Without a CDP, customer data lives in silos. Marketing sees email engagement, sales sees CRM activity, and support sees tickets, but nobody has the full picture. That fragmentation leads to duplicate outreach, conflicting messages, and missed upsell signals. A CDP gives every team the same unified view so they can act on it.",
      "example": "A B2B SaaS company connects HubSpot, Intercom, Stripe, and their product database to Hightouch. When a free-tier user hits a usage threshold and also opens a pricing email, the CDP creates a unified signal that triggers a sales alert and moves the account into a targeted ad audience.",
      "related_terms": [
        "data-enrichment",
        "data-validation"
      ],
      "related_tools": [
        "hightouch",
        "census-data",
        "salesforce",
        "hubspot"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "reverse-etl",
      "term": "Reverse ETL",
      "short_definition": "The process of syncing data from a data warehouse back into operational business tools like CRMs and marketing platforms.",
      "full_definition": "Reverse ETL flips the traditional data pipeline. Instead of pulling data from business tools into a warehouse for analysis, it pushes modeled data back out to the tools where teams actually work. Think of it as the last mile of the modern data stack. Your analytics team builds models in dbt or Looker, and reverse ETL makes those models actionable in Salesforce, HubSpot, Marketo, or wherever your go-to-market team operates.",
      "why_it_matters": "Most companies have better data in their warehouse than in their CRM. Lead scores, health scores, product usage metrics, and segmentation models sit in BigQuery or Snowflake where sales reps can't see them. Reverse ETL closes that gap. It means the data team's work actually reaches the people making decisions, without building custom integrations for every tool.",
      "example": "Your data team builds a product-qualified lead score in Snowflake using signup data, feature usage, and billing info. Census syncs that score to a custom field in Salesforce every hour. Reps can now sort their pipeline by PQL score and prioritize accounts showing real buying signals instead of guessing.",
      "related_terms": [
        "data-enrichment",
        "data-hygiene"
      ],
      "related_tools": [
        "hightouch",
        "census-data",
        "fivetran",
        "airbyte"
      ],
      "category_slug": "orchestration"
    },
    {
      "slug": "sales-intelligence",
      "term": "Sales Intelligence",
      "short_definition": "Technology and data that helps sales teams identify, target, and engage the right buyers at the right time.",
      "full_definition": "Sales intelligence platforms combine contact databases, firmographic data, technographic signals, and buying intent into a single workflow. They're designed to answer three questions: who should I sell to, what do I know about them, and when is the right time to reach out? The best platforms layer multiple data types so reps aren't just cold-calling from a list. They're reaching out with context.",
      "why_it_matters": "Reps spend roughly 40% of their time researching prospects and finding contact info. That's time they aren't selling. Sales intelligence tools compress hours of manual research into seconds. More importantly, they surface signals that reps would never find on their own, like technology changes, hiring surges, or funding rounds that indicate buying windows.",
      "example": "An AE targeting mid-market fintech companies uses ZoomInfo to build a list of CFOs at companies with 200-500 employees that recently raised Series B funding. Apollo flags three of those accounts as showing intent around 'payment processing solutions.' The AE writes personalized outreach referencing the funding round and the specific pain point.",
      "related_terms": [
        "intent-data",
        "data-enrichment",
        "lead-scoring"
      ],
      "related_tools": [
        "zoominfo",
        "apollo",
        "cognism",
        "linkedin-sales-navigator",
        "clearbit"
      ],
      "category_slug": "enrichment"
    },
    {
      "slug": "buyer-intent",
      "term": "Buyer Intent",
      "short_definition": "Signals that indicate a prospect is actively researching or considering a purchase in your category.",
      "full_definition": "Buyer intent captures the digital footprint of someone moving through a buying process. That includes searching for relevant keywords, visiting review sites like G2 or TrustRadius, reading competitor content, attending webinars, or downloading whitepapers. Intent platforms aggregate these signals across thousands of publisher sites and score accounts based on research intensity. First-party intent tracks behavior on your own site. Third-party intent tracks behavior across the broader web.",
      "why_it_matters": "Timing is everything in B2B sales. Reaching an account six months before they're ready to buy wastes effort. Reaching them two weeks after they've signed with a competitor wastes even more. Buyer intent data tells you which accounts are in-market right now, so you can prioritize outreach to companies that are already thinking about solutions like yours.",
      "example": "Bombora detects that a target account has had multiple employees researching 'CRM migration,' 'Salesforce alternatives,' and 'HubSpot enterprise pricing' over the past three weeks. The intent score spikes from 40 to 85. Your SDR team gets an alert and moves that account to the top of their outreach queue with messaging focused on CRM switching costs.",
      "related_terms": [
        "intent-data",
        "abm",
        "lead-scoring"
      ],
      "related_tools": [
        "6sense",
        "demandbase",
        "bombora",
        "zoominfo"
      ],
      "category_slug": "intent"
    },
    {
      "slug": "data-orchestration",
      "term": "Data Orchestration",
      "short_definition": "The automated coordination of data flows between multiple systems, tools, and processes.",
      "full_definition": "Data orchestration is the connective tissue of a modern go-to-market stack. It handles the logic of when data moves, where it goes, and what happens along the way. That might mean enriching a new lead in HubSpot, routing it to the right sales rep, syncing the record to Outreach, and updating a reporting dashboard, all triggered automatically by a single form submission. It goes beyond point-to-point integrations by managing multi-step workflows with branching logic, error handling, and conditional transforms.",
      "why_it_matters": "Most teams run 15-30 SaaS tools. Without orchestration, data gets stuck in silos or requires manual copy-paste between systems. That creates delays, errors, and inconsistencies. When your orchestration breaks, your whole revenue engine slows down. Good orchestration means every team works with the same data, at the same time, without anyone manually moving spreadsheets around.",
      "example": "A new inbound lead fills out a demo form. Zapier triggers a workflow: the lead is enriched via Clearbit, scored by a custom model, routed to the right SDR in Salesforce based on territory rules, added to a personalized Outreach sequence, and flagged in Slack for the sales manager. All of this happens in under 60 seconds with no manual steps.",
      "related_terms": [
        "data-enrichment",
        "data-hygiene",
        "revops"
      ],
      "related_tools": [
        "workato-ipaas",
        "zapier",
        "make",
        "n8n",
        "boomi",
        "mulesoft"
      ],
      "category_slug": "orchestration"
    },
    {
      "slug": "sales-automation",
      "term": "Sales Automation",
      "short_definition": "Technology that automates repetitive sales tasks like follow-up emails, data entry, lead routing, and activity logging.",
      "full_definition": "Sales automation handles the mechanical work that eats into a rep's selling time. That includes automated email sequences (drip campaigns that fire based on time or prospect behavior), CRM data entry (logging calls, updating deal stages, capturing meeting notes), lead routing (assigning new leads to the right rep based on territory, round-robin, or scoring rules), and task creation (automatically generating follow-up reminders after meetings or when deals go cold).",
      "why_it_matters": "Sales reps spend roughly 30% of their time actually selling. The rest goes to data entry, administrative tasks, internal meetings, and prospecting logistics. Sales automation reclaims a chunk of that non-selling time by eliminating manual steps. A rep who doesn't have to remember to follow up, log activities, or update deal stages can focus on conversations that close deals.",
      "example": "An SDR connects with a prospect on a call. When the call ends, Gong transcribes it and pushes a summary to Salesforce. Outreach automatically creates a follow-up task for 3 days later. If the prospect doesn't respond, an automated email sequence starts 5 days after the call with personalized content. The SDR didn't touch the CRM once.",
      "related_terms": [
        "sales-engagement",
        "sales-cadence",
        "revops"
      ],
      "related_tools": [
        "salesloft",
        "outreach-io",
        "hubspot",
        "salesforce"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "buyer-journey",
      "term": "Buyer Journey",
      "short_definition": "The process a B2B buyer goes through from initial awareness of a problem to selecting and purchasing a solution.",
      "full_definition": "The buyer journey maps the stages a prospect moves through before becoming a customer. In B2B, it typically follows three phases: awareness (the buyer recognizes a problem or opportunity), consideration (the buyer evaluates different approaches and solutions), and decision (the buyer selects a vendor and negotiates terms). B2B buyer journeys are longer and more complex than B2C, often involving 6-10 stakeholders, 3-6 month sales cycles, and dozens of content touchpoints before a purchase decision.",
      "why_it_matters": "Aligning your marketing and sales efforts to the buyer's actual journey is what separates targeted outreach from spam. A prospect in the awareness stage doesn't want a demo. A prospect in the decision stage doesn't want a blog post about industry trends. Understanding where accounts sit in their journey lets you deliver the right content, through the right channel, at the right time. Intent data has made this mapping more precise by revealing which stage a company is in based on their research behavior.",
      "example": "A VP of Sales at a mid-market company reads three blog posts about CRM migration (awareness). She downloads a CRM comparison guide and visits G2 to read reviews (consideration). She requests demos from two vendors and involves her CFO and IT director in evaluation calls (decision). Each stage requires different content and engagement from the selling organization.",
      "related_terms": [
        "buyer-intent",
        "intent-data",
        "lead-scoring",
        "abm"
      ],
      "related_tools": [
        "6sense",
        "demandbase",
        "hubspot"
      ],
      "category_slug": "intent"
    },
    {
      "slug": "lead-routing",
      "term": "Lead Routing",
      "short_definition": "The automated process of assigning incoming leads to the right sales rep based on predefined rules.",
      "full_definition": "Lead routing determines which sales rep gets which lead. The simplest approach is round-robin (each rep gets the next lead in rotation). More sophisticated routing uses rules based on territory (geographic or industry assignment), deal size (enterprise leads go to senior reps), product interest (route to the specialist), account ownership (existing customer leads go to their assigned rep), or lead score (hot leads get routed to top performers). Speed-to-lead studies consistently show that responding to an inbound lead within 5 minutes vs. 30 minutes increases conversion rates by 10x or more.",
      "why_it_matters": "Slow or incorrect routing kills conversions. A lead that sits unassigned for 24 hours has already moved on. A lead routed to the wrong rep (wrong territory, wrong product line) creates a bad first impression and internal friction. Automated routing eliminates the 'someone will get to it' gap and ensures every lead hits the right rep's queue within seconds of arriving.",
      "example": "A director of marketing at a 500-person company in Chicago fills out a demo request form. The CRM checks: company size (mid-market routing), industry (technology), geography (Central territory), existing account owner (none). The lead is automatically assigned to the Central mid-market AE, a Slack notification fires, and the rep's Outreach sequence starts a personalized cadence within 2 minutes of form submission.",
      "related_terms": [
        "lead-scoring",
        "revops",
        "sales-automation"
      ],
      "related_tools": [
        "salesforce",
        "hubspot",
        "salesloft"
      ],
      "category_slug": "crm"
    },
    {
      "slug": "data-deduplication",
      "term": "Data Deduplication",
      "short_definition": "The process of identifying and merging or removing duplicate records in a database or CRM.",
      "full_definition": "Data deduplication (dedup) finds and resolves duplicate records that accumulate in CRMs and databases. Duplicates happen when the same person or company gets entered multiple times through different channels (web forms, manual entry, data imports, integrations). Basic deduplication matches on exact fields (same email address). Advanced deduplication uses fuzzy matching (\"John Smith\" at \"Acme Corp\" vs. \"J. Smith\" at \"Acme Corporation\"), domain matching, and probabilistic algorithms to catch near-duplicates that exact matching misses.",
      "why_it_matters": "Duplicates wreck everything downstream. Lead routing breaks when the same company has three records assigned to different reps. Marketing sends the same person three emails. Pipeline reporting inflates because the same opportunity appears twice. Territory planning miscounts accounts. Sales reps waste time calling the same prospect that a colleague already spoke to. Studies estimate that 10-30% of CRM records are duplicates in the average B2B organization.",
      "example": "Your CRM has three records for the same person: 'Michael Johnson' from a trade show scan, 'Mike Johnson' from a web form, and 'M. Johnson' imported via your data enrichment tool. All three have different email formats but the same company domain. A deduplication tool identifies all three as the same person, merges the records (keeping the most complete data from each), and assigns one clean master record to the correct account owner.",
      "related_terms": [
        "data-hygiene",
        "data-validation",
        "data-enrichment"
      ],
      "related_tools": [
        "demandtools",
        "salesforce",
        "hubspot"
      ],
      "category_slug": "data-quality"
    },
    {
      "slug": "sales-cadence",
      "term": "Sales Cadence",
      "short_definition": "A structured sequence of outreach touchpoints (emails, calls, social touches) designed to engage a prospect over a defined period.",
      "full_definition": "A sales cadence is a playbook for prospect engagement. It defines what to do, when, and through which channel. A typical outbound cadence might span 14-21 days with 8-12 touchpoints: Day 1 email, Day 2 LinkedIn connection, Day 3 call, Day 5 email, Day 7 call, Day 10 email with case study, Day 14 breakup email. Cadences can be manual (rep executes each step), semi-automated (emails fire automatically, calls and social are manual), or fully automated (all steps execute without rep input). Sales engagement platforms like Outreach and Salesloft are built around cadence management.",
      "why_it_matters": "Without a defined cadence, reps follow up inconsistently. Some prospects get five touches in two days (annoying). Others get one email and then nothing for a month (forgotten). Structured cadences ensure every prospect gets the right number of touches at the right intervals, which directly impacts reply rates and pipeline generation. Data from multiple studies shows that multi-channel cadences (email + phone + social) outperform single-channel approaches by 2-3x on reply rates.",
      "example": "An SDR adds a target prospect to a 14-day multi-channel cadence in Outreach. Day 1: personalized email referencing the company's recent funding round. Day 2: LinkedIn connection request with a short note. Day 4: phone call attempt. Day 7: follow-up email with a relevant case study. Day 10: call + voicemail. Day 14: final breakup email. If the prospect replies at any point, the cadence pauses and the rep takes over manually.",
      "related_terms": [
        "sales-engagement",
        "sales-automation"
      ],
      "related_tools": [
        "outreach-io",
        "salesloft",
        "apollo",
        "instantly",
        "lemlist"
      ],
      "category_slug": "crm"
    }
  ]
}
